app/controllers/movies_controller.rb


    @checked_ratings = @checked_ratings_hash != nil ? @checked_ratings_hash.keys : []
    @search_ratings = @checked_ratings.empty?() ? @all_ratings : @checked_ratings
    @movies = Movie.find_all_by_rating(@search_ratings, :order => @sorted_field)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13') ORDER BY release_date