app/controllers/movies_controller.rb

  def index
    #This is where all indexing will need to happen!!!!
    #@movies = Movie.all #Original Code: this just displays all
    @movies = Movie.order(params[:sort]) #this takes movies and uses the order function with sort parameters to reorder and diplay the list
---
SELECT "movies".* FROM "movies" ORDER BY release_date